EduCater/Documents/Перемещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Перемещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СырьёОстатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПеремещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладРасход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПриход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сырьё</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сырьё</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сырьё</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Измерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EduCater/AccumulationRegisters/СырьёОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>СырьёОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сырьё</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сырьё</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Измерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EduCater/Documents/Перемещение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СырьёОстатки Расход
	Движения.СырьёОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаСырьё Из Сырьё Цикл
		Движение = Движения.СырьёОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Поставщик = Константы.Организация.Получить();
		Движение.Склад = СкладРасход;
		Движение.Сырьё = ТекСтрокаСырьё.Сырьё;
		Движение.Измерение = ТекСтрокаСырьё.Измерение;
		//Движение.Цена = ТекСтрокаСырьё.Цена;
		Движение.Количество = ТекСтрокаСырьё.Количество;
	КонецЦикла;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СырьёОстаткиОстатки.Сырьё КАК Сырьё,
		|	СырьёОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	СырьёОстаткиОстатки.Склад КАК Склад,  
		|   СырьёОстаткиОстатки.Измерение КАК Измерение
		|ИЗ
		|	РегистрНакопления.СырьёОстатки.Остатки(
		|			,
		|			Склад В (&Склад)
		|				И Сырьё В (&МассивСырья)
		|					И Измерение В (&МассивИзмерений)) КАК СырьёОстаткиОстатки
		|ГДЕ
		|	СырьёОстаткиОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", СкладРасход);
	Запрос.УстановитьПараметр("МассивИзмерений", Сырьё.ВыгрузитьКолонку("Измерение"));
	Запрос.УстановитьПараметр("МассивСырья", Сырьё.ВыгрузитьКолонку("Сырьё"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() ЦИКЛ
			Сообщить("На складе '" + Выборка.Склад + "'  не хватает " +
			Выборка.КоличествоОстаток* (-1) + " " + Выборка.Измерение +" сырья '" + Выборка.Сырьё + "'");
		КонецЦикла;
	КонецЕсли;
		
	// регистр СырьёОстатки Приход
	Движения.СырьёОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаСырьё Из Сырьё Цикл
		Движение = Движения.СырьёОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Поставщик = Константы.Организация.Получить();
		Движение.Склад = СкладПриход;
		Движение.Сырьё = ТекСтрокаСырьё.Сырьё;
		Движение.Измерение = ТекСтрокаСырьё.Измерение;
		//Движение.Цена = ТекСтрокаСырьё.Цена;
		Движение.Количество = ТекСтрокаСырьё.Количество;
	КонецЦикла;
КонецПроцедуры
